#Задание 1.
n = int(input("Введите количество байт: "))
b = n * 8
print("Полученное количество бит:",j)
#Задание 2.
a = int(input("Введите количество страниц: "))
b = int(input("Введите количество строк: "))
c = int(input("Введите количество символов: "))
colv = a*b*c
print(colv/1024,"Кбайт")











































































































By lonely
